# Tappity Taps
tap "warrensbox/tap"
tap "InstantClientTap/instantclient"

# Basic CLI binaries
brew "git"
brew "awscli"
brew "aws-vault"
brew "autojump"
brew "jq"
brew "libsodium"

# Version Managers
brew "rbenv"
brew "pyenv"
brew "nvm"
brew "tfswitch"
brew "tgswitch"

# Database
brew "postgresql"

# OCI
brew "instantclient-basic"
brew "instantclient-sdk"
brew "instantclient-sqlplus"
cask "microsoft-office"

# Productivity App(s)
cask "rectangle"
cask "notion"
cask "google-chrome"
cask "spotify"

# Protect Me
cask "bitwarden"
cask "authy"

# Communicate
cask "telegram-desktop"
cask "discord"
cask "slack"
cask "zoom"
cask "microsoft-teams"
cask "whatsapp"

# Development Thingy
cask "iterm2"
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "docker"
cask "session-manager-plugin"
cask "postman"
cask "tunnelblick"

# MDM
cask "intune-company-portal"
